export const historyItems = [
  {
    period: '2020.01',
    title: 'エムスリー インターン',
    body:
      'クラウド電子カルテの開発を行なっているデジカルチームで就業しました。\n課題はAngularJSからReactへのリプレースを選択し、2週間の中でモーダルダイアログ・テキストエディタの2箇所のリプレースを担当しました。\n後者は長い間運用されていたtextAngularを複雑な依存関係から引き剥がし、Facebook製のフレームワークであるdraft.jsに書き換えることに成功しました。\n成果発表では、挑戦的な課題に挑戦し期間内に成果を残した点・大きい課題を小さく切り分けて進めた点・実装方針の検討にきちんと時間を割いた点を評価して頂きました。',
    tags: ['angularjs', 'react', 'draftjs']
  },
  {
    period: '2019.09 ~ 12',
    title: 'エウレカ インターン',
    body:
      'Webフロントエンドチームで就業し、SP版リニューアルプロジェクトやキャンペーン用LPの作成に携わりました。\n入社時にはSP版リニューアルは終盤戦を迎えており、既にReactへリプレースされたSP版の開発・運用をメインで行いました。\nこれまでで最も多いユーザ数を持つ大規模サービスを開発する中で、安全性やコードアーキテクチャといった面で学びがありました。\nまた長期間続いたプロジェクトの終盤〜リリースに携わることで、タスク管理やプロジェクトマネジメントについて考えるキッカケになりました。',
    tags: ['typescript', 'react', 'redux']
  },
  {
    period: '2019.09',
    title: 'DMM.com インターン',
    body:
      'DMMが実際に抱えている技術的な課題に挑戦するクエスト型インターン、DMM Guildに参加しました。\nフロントエンドのタスクを中心に、Vanilla JSを用いた管理画面への機能追加・Vue.jsを用いた管理画面のバグ修正・Reactを用いたWebページへのReduxの試験的導入に取り組みました。\n2週間という短期間の中で、今まで触れたことのなかった様々な技術に挑戦できました。',
    tags: ['vue', 'react', 'redux', 'vanillajs']
  },
  {
    period: '2019.01 ~ 08',
    title: 'FIREBUG インターン',
    body:
      'React Native / Graph QLを用いたtoB向けマッチングアプリの開発に携わりました。\nクライアントサイドの実装をメインで担当し、デザイン作成・バグ修正・機能追加・リファクタリングなど裁量大きく働かせて頂きました。\nモダンな技術を積極的、かつ、慎重に採用しており、技術選定の重要さを実感することができました。\nまた、リリース前のQAチェックやスプレッドシートへのデータ書き出し、LP作成といった様々なタスクにも取り組み、Webサービス全体を少人数で支えるスタートアップならではの開発経験ができました。',
    tags: ['typescript', 'reactnative', 'graphql']
  },
  {
    period: '2018.12 ~ 01',
    title: 'Apollo インターン',
    body:
      'Webサービス開発における基礎から初めてのチーム開発まで経験し、自分がWebエンジニアを志すキッカケになりました。\nHTML・CSS・git・Reactなどに関する様々な課題をこなし、その後、実際のサービス開発に携わりました。',
    tags: ['html/css', 'typescript', 'jquery', 'react']
  }
];
